aslucas-dev/STM32F072-Drivers/0_systick/systick.c
/**
  ***************************************************************************************
  * @file    
  * @author  Lucas
  * @date    Mar 21, 2026
  * @brief   
  *           
  *          
  *          
  *       
  @verbatim                
  =======================================================================================
                      #####  specific features #####
  =======================================================================================
    [..]  
      (+) 
                      #####  Limitations #####
  =======================================================================================
    [..]  
      
      (+) 
      (++) 

  @endverbatim
  ***************************************************************************************
  * @attention
  *
  ***************************************************************************************
  */


//.......................................................................................
#include "systick.h"
#include "stm32f0xx.h"
//.......................................................................................
static volatile uint32_t systick_count = 0;
//.......................................................................................

/**====================================================================================*
 *  @brief                                                                             *
 *                                                                                     *
 *  @param                                                                             *
 *                                                                                     *
 *  @retval                                                                            *
 *                                                                                     *
 *-------------------------------------------------------------------------------------*/
void SysTick_Handler(void)
{
    NVIC_ClearPendingIRQ(SysTick_IRQn);
    systick_count++;
}

/**====================================================================================*
 *  @brief                                                                             *
 *                                                                                     *
 *  @param                                                                             *
 *                                                                                     *
 *  @retval                                                                            *
 *                                                                                     *
 *-------------------------------------------------------------------------------------*/
static void reset(void)
{
    NVIC_DisableIRQ(SysTick_IRQn);
    SysTick->CTRL = 0;
    SysTick->LOAD = 0;
    SysTick->VAL = 0;
}

 /**====================================================================================*
 *  @brief                                                                             *
 *                                                                                     *
 *  @param                                                                             *
 *                                                                                     *
 *  @retval                                                                            *
 *                                                                                     *
 *-------------------------------------------------------------------------------------*/
static void config(uint32_t frequency_tick, uint32_t systick_clock)
{
    SysTick->LOAD = (systick_clock / frequency_tick) - 1;
    NVIC_ClearPendingIRQ(SysTick_IRQn);
    NVIC_EnableIRQ(SysTick_IRQn);
    SysTick->CTRL =  SysTick_CTRL_CLKSOURCE_Msk |
            SysTick_CTRL_TICKINT_Msk |
            SysTick_CTRL_ENABLE_Msk;
}

 /**====================================================================================*
 *  @brief                                                                             *
 *                                                                                     *
 *  @param                                                                             *
 *                                                                                     *
 *  @retval                                                                            *
 *                                                                                     *
 *-------------------------------------------------------------------------------------*/
 void systick_init(uint32_t frequency_tick, uint32_t systick_clock)
 {
    reset();

    if ((frequency_tick == 0) || 
        (systick_clock == 0) ||
        (frequency_tick > systick_clock)) {
        return;
    }
    
    config(frequency_tick, systick_clock);
 }

 /**====================================================================================* 
 *  @brief                                                                             * 
 *                                                                                     * 
 *  @param                                                                             * 
 *                                                                                     * 
 *  @retval                                                                            * 
 *                                                                                     * 
 *-------------------------------------------------------------------------------------*/
 void systick_deinit(void)
 {
    reset();
 }